------
# Course 2 - Week03 - Day02 - Practice Exercise 01
------

# Agenda
- Pandas
  - Readign files from different sources
  - Concatenate series and dataframe
  - Merging, Joining and Reshaping dataframes

# Pandas in Python
- Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures
- Using Pandas, we can accomplish five typical steps in the processing and analysis of data, regardless of the origin of data â€” load, prepare, manipulate, model, and analyze
- Python with Pandas is used in a wide range of fields including academic and commercial domains including finance, economics, Statistics, analytics, etc

### Key Features of Pandas
- Fast and efficient DataFrame object with default and customized indexing
- Tools for loading data into in-memory data objects from different file formats
- Data alignment and integrated handling of missing data
- Reshaping and pivoting of date sets
- Label-based slicing, indexing and subsetting of large data sets
- Columns from a data structure can be deleted or inserted
- Group by data for aggregation and transformations
- High performance merging and joining of data
- Time Series functionality

### 1. Reading the files from different sources

##### Read 'Product_Data.xlsx' file and convert it to dataframe

In [ ]:
import pandas as pd
df_excel = pd.read_excel('Product_Data.xlsx')
df_excel.head()

            Product   Price
0  Desktop Computer   700.0
1            Tablet   250.0
2           Printer   120.0
3            Laptop  1200.0

##### Read 'Product_Data.html' file and convert it to dataframe

In [ ]:
df_html = pd.read_html('Product_Data.html')
df_html

[            Product   Price
 0  Desktop Computer   700.0
 1            Tablet   250.0
 2           Printer   120.0
 3            Laptop  1200.0]

##### Read 'Product_Data.csv' file and convert it to dataframe

In [ ]:
df_csv = pd.read_csv('Product_Data.csv')
df_csv.head()

            Product   Price
0  Desktop Computer   700.0
1            Tablet   250.0
2           Printer   120.0
3            Laptop  1200.0

##### Read 'Product_Data.txt' file and convert it to dataframe

In [ ]:
df_txt = pd.read_csv('Product_Data.txt', sep='\t')
df_txt.head()

            Product  Price
0  Desktop Computer    700
1            Tablet    250
2           Printer    120
3            Laptop   1200

##### Read 'Product_Data.json' file and convert it to dataframe

In [ ]:
df_json = pd.read_json('Product_Data.json')
df_json.head()

            Product  Price
0  Desktop Computer    700
1            Tablet    250
2           Printer    120
3            Laptop   1200

##### Read 'Product_Data.xml' file and convert it to dataframe

In [ ]:
df_xml = pd.read_xml('Product_Data.xml')
df_xml.head()

            Product   Price
0  Desktop Computer   700.0
1            Tablet   250.0
2           Printer   120.0
3            Laptop  1200.0

##### Load wine and diabetes dataset from sklearn and display the details about the dataset

In [ ]:
from sklearn.datasets import load_wine
from sklearn.datasets import load_diabetes

In [ ]:
# we can load wine dataset from sklearn library
wine_data = load_wine()

# we can load diabetes dataset from sklearn library
diabetes_data = load_diabetes()

In [ ]:
# See the information about the dataset
wine_data

{'data': array([[1.423e+01, 1.710e+00, 2.430e+00, ..., 1.040e+00, 3.920e+00,
         1.065e+03],
        [1.320e+01, 1.780e+00, 2.140e+00, ..., 1.050e+00, 3.400e+00,
         1.050e+03],
        [1.316e+01, 2.360e+00, 2.670e+00, ..., 1.030e+00, 3.170e+00,
         1.185e+03],
        ...,
        [1.327e+01, 4.280e+00, 2.260e+00, ..., 5.900e-01, 1.560e+00,
         8.350e+02],
        [1.317e+01, 2.590e+00, 2.370e+00, ..., 6.000e-01, 1.620e+00,
         8.400e+02],
        [1.413e+01, 4.100e+00, 2.740e+00, ..., 6.100e-01, 1.600e+00,
         5.600e+02]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2]),
 'frame': None,
 'target_names': array(['class_0', 'class_1', 'class_2'], dtype='<U7'),
 'DESCR': '.. _wine_dataset:\n\nWine recognition dataset\n------------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 178 (50 in each of three classes)\n    :Number of Attributes: 13 numeric, predictive attributes and the class\n    :Attribute Information:\n \t\t- Alcohol\n \t\t- Malic acid\n \t\t- Ash\n\t\t- Alcalinity of ash  \n \t\t- Magnesium\n\t\t- Total phenols\n \t\t- Flavanoids\n \t\t- Nonflavanoid phenols\n \t\t- Proanthocyanins\n\t\t- Color intensity\n \t\t- Hue\n \t\t- OD280/OD315 of diluted wines\n \t\t- Proline\n\n    - class:\n            - class_0\n            - class_1\n            - class_2\n\t\t\n    :Summary Statistics:\n    \n    ============================= ==== ===== ======= =====\n                                   Min   Max   Mean     SD\n    ============================= ==== ===== ======= =====\n    Alcohol:                      11.0  14.8    13.0   0.8\n    Malic Acid:                   0.74  5.80    2.34  1.12\n    Ash:                          1.36  3.23    2.36  0.27\n    Alcalinity of Ash:            10.6  30.0    19.5   3.3\n    Magnesium:                    70.0 162.0    99.7  14.3\n    Total Phenols:                0.98  3.88    2.29  0.63\n    Flavanoids:                   0.34  5.08    2.03  1.00\n    Nonflavanoid Phenols:         0.13  0.66    0.36  0.12\n    Proanthocyanins:              0.41  3.58    1.59  0.57\n    Colour Intensity:              1.3  13.0     5.1   2.3\n    Hue:                          0.48  1.71    0.96  0.23\n    OD280/OD315 of diluted wines: 1.27  4.00    2.61  0.71\n    Proline:                       278  1680     746   315\n    ============================= ==== ===== ======= =====\n\n    :Missing Attribute Values: None\n    :Class Distribution: class_0 (59), class_1 (71), class_2 (48)\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThis is a copy of UCI ML Wine recognition datasets.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data\n\nThe data is the results of a chemical analysis of wines grown in the same\nregion in Italy by three different cultivators. There are thirteen different\nmeasurements taken for different constituents found in the three types of\nwine.\n\nOriginal Owners: \n\nForina, M. et al, PARVUS - \nAn Extendible Package for Data Exploration, Classification and Correlation. \nInstitute of Pharmaceutical and Food Analysis and Technologies,\nVia Brigata Salerno, 16147 Genoa, Italy.\n\nCitation:\n\nLichman, M. (2013). UCI Machine Learning Repository\n[https://archive.ics.uci.edu/ml]. Irvine, CA: University of California,\nSchool of Information and Computer Science. \n\n.. topic:: References\n\n  (1) S. Aeberhard, D. Coomans and O. de Vel, \n  Comparison of Classifiers in High Dimensional Settings, \n  Tech. Rep. no. 92-02, (1992), Dept. of Computer Science and Dept. of  \n  Mathematics and Statistics, James Cook University of North Queensland. \n  (Also submitted to Technometrics). \n\n  The data was used with many others for comparing various \n  classifiers. The classes are separable, though only RDA \n  has achieved 100% correct classification. \n  (RDA : 100%, QDA 99.4%, LDA 98.9%, 1NN 96.1% (z-transformed data)) \n  (All results using the leave-one-out technique) \n\n  (2) S. Aeberhard, D. Coomans and O. de Vel, \n  "THE CLASSIFICATION PERFORMANCE OF RDA" \n  Tech. Rep. no. 92-01, (1992), Dept. of Computer Science and Dept. of \n  Mathematics and Statistics, James Cook University of North Queensland. \n  (Also submitted to Journal of Chemometrics).\n',
 'feature_names': ['alcohol',
  'malic_acid',
  'ash',
  'alcalinity_of_ash',
  'magnesium',
  'total_phenols',
  'flavanoids',
  'nonflavanoid_phenols',
  'proanthocyanins',
  'color_intensity',
  'hue',
  'od280/od315_of_diluted_wines',
  'proline']}

#### To know the details about the data

In [ ]:
wine_data.data

array([[1.423e+01, 1.710e+00, 2.430e+00, ..., 1.040e+00, 3.920e+00,
        1.065e+03],
       [1.320e+01, 1.780e+00, 2.140e+00, ..., 1.050e+00, 3.400e+00,
        1.050e+03],
       [1.316e+01, 2.360e+00, 2.670e+00, ..., 1.030e+00, 3.170e+00,
        1.185e+03],
       ...,
       [1.327e+01, 4.280e+00, 2.260e+00, ..., 5.900e-01, 1.560e+00,
        8.350e+02],
       [1.317e+01, 2.590e+00, 2.370e+00, ..., 6.000e-01, 1.620e+00,
        8.400e+02],
       [1.413e+01, 4.100e+00, 2.740e+00, ..., 6.100e-01, 1.600e+00,
        5.600e+02]])

In [ ]:
wine_data.target

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2])

In [ ]:
wine_data.target_names

array(['class_0', 'class_1', 'class_2'], dtype='<U7')

In [ ]:
wine_data.DESCR

'.. _wine_dataset:\n\nWine recognition dataset\n------------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 178 (50 in each of three classes)\n    :Number of Attributes: 13 numeric, predictive attributes and the class\n    :Attribute Information:\n \t\t- Alcohol\n \t\t- Malic acid\n \t\t- Ash\n\t\t- Alcalinity of ash  \n \t\t- Magnesium\n\t\t- Total phenols\n \t\t- Flavanoids\n \t\t- Nonflavanoid phenols\n \t\t- Proanthocyanins\n\t\t- Color intensity\n \t\t- Hue\n \t\t- OD280/OD315 of diluted wines\n \t\t- Proline\n\n    - class:\n            - class_0\n            - class_1\n            - class_2\n\t\t\n    :Summary Statistics:\n    \n    ============================= ==== ===== ======= =====\n                                   Min   Max   Mean     SD\n    ============================= ==== ===== ======= =====\n    Alcohol:                      11.0  14.8    13.0   0.8\n    Malic Acid:                   0.74  5.80    2.34  1.12\n    Ash:                          1.36  3.23    2.36  0.27\n    Alcalinity of Ash:            10.6  30.0    19.5   3.3\n    Magnesium:                    70.0 162.0    99.7  14.3\n    Total Phenols:                0.98  3.88    2.29  0.63\n    Flavanoids:                   0.34  5.08    2.03  1.00\n    Nonflavanoid Phenols:         0.13  0.66    0.36  0.12\n    Proanthocyanins:              0.41  3.58    1.59  0.57\n    Colour Intensity:              1.3  13.0     5.1   2.3\n    Hue:                          0.48  1.71    0.96  0.23\n    OD280/OD315 of diluted wines: 1.27  4.00    2.61  0.71\n    Proline:                       278  1680     746   315\n    ============================= ==== ===== ======= =====\n\n    :Missing Attribute Values: None\n    :Class Distribution: class_0 (59), class_1 (71), class_2 (48)\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThis is a copy of UCI ML Wine recognition datasets.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data\n\nThe data is the results of a chemical analysis of wines grown in the same\nregion in Italy by three different cultivators. There are thirteen different\nmeasurements taken for different constituents found in the three types of\nwine.\n\nOriginal Owners: \n\nForina, M. et al, PARVUS - \nAn Extendible Package for Data Exploration, Classification and Correlation. \nInstitute of Pharmaceutical and Food Analysis and Technologies,\nVia Brigata Salerno, 16147 Genoa, Italy.\n\nCitation:\n\nLichman, M. (2013). UCI Machine Learning Repository\n[https://archive.ics.uci.edu/ml]. Irvine, CA: University of California,\nSchool of Information and Computer Science. \n\n.. topic:: References\n\n  (1) S. Aeberhard, D. Coomans and O. de Vel, \n  Comparison of Classifiers in High Dimensional Settings, \n  Tech. Rep. no. 92-02, (1992), Dept. of Computer Science and Dept. of  \n  Mathematics and Statistics, James Cook University of North Queensland. \n  (Also submitted to Technometrics). \n\n  The data was used with many others for comparing various \n  classifiers. The classes are separable, though only RDA \n  has achieved 100% correct classification. \n  (RDA : 100%, QDA 99.4%, LDA 98.9%, 1NN 96.1% (z-transformed data)) \n  (All results using the leave-one-out technique) \n\n  (2) S. Aeberhard, D. Coomans and O. de Vel, \n  "THE CLASSIFICATION PERFORMANCE OF RDA" \n  Tech. Rep. no. 92-01, (1992), Dept. of Computer Science and Dept. of \n  Mathematics and Statistics, James Cook University of North Queensland. \n  (Also submitted to Journal of Chemometrics).\n'

### 2. Merging / Concatenating Series

#### Concatenate the series s1 & s2

In [ ]:
import numpy as np
import pandas as pd

s1 = pd.Series(["X0", "X1", "X2", "X3"], name="X")
s2 = pd.Series(["0", "-1", "-2", "-3"], name="Y")

In [ ]:
result = pd.concat([s1, s2], axis=1)
result

    X   Y
0  X0   0
1  X1  -1
2  X2  -2
3  X3  -3

#### Concatenate the series s3, s4 & s5

In [ ]:
s3 = pd.Series([0, 1, 2, 3], name="foo")
s3

0    0
1    1
2    2
3    3
Name: foo, dtype: int64

In [ ]:
s4 = pd.Series([0, 1, 2, 3], name = 'baz')
s4

0    0
1    1
2    2
3    3
Name: baz, dtype: int64

In [ ]:
s5 = pd.Series([0, 1, 4, 5], name='bar')
s5

0    0
1    1
2    4
3    5
Name: bar, dtype: int64

In [ ]:
pd.concat([s3, s4, s5], axis=1)

   foo  baz  bar
0    0    0    0
1    1    1    1
2    2    2    4
3    3    3    5

#### Concatenate the series s3, s4 & s5 and change the column names to 'red', 'blue', 'yellow' from 'foo', 'baz' and 'bar'

In [ ]:
pd.concat([s3, s4, s5], axis=1, keys=["red", "blue", "yellow"])

   red  blue  yellow
0    0     0       0
1    1     1       1
2    2     2       4
3    3     3       5

### 3. Merging Dataframe and Series

In [ ]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)


df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)


df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

#### Conver the dataframes df1, df2 & df3 to series and then concatenate

In [ ]:
frames = [df1, df2, df3]

result = pd.concat(frames)
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Convert the dataframes df1, df2 & df3 to sereis and then concatenate by assigning keys 'x', 'y' & 'z'

In [ ]:
merge = pd.concat(frames, keys=["x", "y", "z"])
merge

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [ ]:
print(merge.loc['x'])
print('-'*30)
print(merge.loc['y'])
print('-'*30)
print(merge.loc['z'])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
------------------------------
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
------------------------------
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
# Alternative way of merging dataframe and series
pieces = {"x": df1, "y": df2, "z": df3}
result = pd.concat(pieces)
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

### 4. Merging and Concatenating Dataframes
- **Need** - There are times when we need data from two or more dataframes in order to find relation between features. In such cases, pandas concat, merge, join functions are very handy and useful.

In [ ]:
import pandas as pd
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [ ]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

#### Concatenate the dataframes df1 & df2

In [ ]:
pd.concat([df1, df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

Suppose we wanted to associate specific keys with each of the pieces of the chopped up DataFrame. We can do this using the keys argument.

#### Concatenate the dataframes df1 & df2 with keys x & y

In [ ]:
pd.concat([df1, df2], keys=["x", "y"])

      A   B   C   D
x 0  A0  B0  C0  D0
  1  A1  B1  C1  D1
  2  A2  B2  C2  D2
  3  A3  B3  C3  D3
y 4  A4  B4  C4  D4
  5  A5  B5  C5  D5
  6  A6  B6  C6  D6
  7  A7  B7  C7  D7

#### Merging Dataframes
- pandas merge function details can be checked [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html?highlight=merge#pandas.DataFrame.merge)

In [ ]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [ ]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [ ]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

#### Merge the dataframes df1 & df2 with 'lkey' and 'rkey'

In [ ]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

#### Merge the dataframes df1 & df2 with 'lkey', 'rkey' and suffixes=('_left', '_right')

In [ ]:
df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have any overlapping columns.

In [ ]:
df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))

ValueError: columns overlap but no suffix specified: Index(['value'], dtype='object')

#### Do an 'inner' merge with dataframes df1 & df2 on 'value'

In [ ]:
df1.merge(df2, how='inner', on='value')

  lkey  value rkey
0  foo      5  foo

#### Do a 'left' merge with dataframes df1 & df2 on 'value'

In [ ]:
df1.merge(df2, how='left', on='value')

  lkey  value rkey
0  foo      1  NaN
1  bar      2  NaN
2  baz      3  NaN
3  foo      5  foo

#### Do a 'right' merge with dataframes df1 & df2 on 'value'

In [ ]:
df1.merge(df2, how='right', on='value')

  lkey  value rkey
0  foo      5  foo
1  NaN      6  bar
2  NaN      7  baz
3  NaN      8  foo

#### Do a 'cross' merge with dataframes df1 & df2

In [ ]:
df1.merge(df2, how='cross')

   lkey  value_x rkey  value_y
0   foo        1  foo        5
1   foo        1  bar        6
2   foo        1  baz        7
3   foo        1  foo        8
4   bar        2  foo        5
5   bar        2  bar        6
6   bar        2  baz        7
7   bar        2  foo        8
8   baz        3  foo        5
9   baz        3  bar        6
10  baz        3  baz        7
11  baz        3  foo        8
12  foo        5  foo        5
13  foo        5  bar        6
14  foo        5  baz        7
15  foo        5  foo        8

### 5. Pandas DataFrame - Join

In [ ]:
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
df1

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

In [ ]:
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                      'B': ['B0', 'B1', 'B2']})

df2

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

#### Join DataFrames using their indexes.

In [ ]:
df1.join(df2, lsuffix='_caller', rsuffix='_other')

  key_caller   A key_other    B
0         K0  A0        K0   B0
1         K1  A1        K1   B1
2         K2  A2        K2   B2
3         K3  A3       NaN  NaN
4         K4  A4       NaN  NaN
5         K5  A5       NaN  NaN

#### If we want to join using the key columns, we need to set key to be the index in both df1 and df2. The joined DataFrame will have key as its index.
#### Join the dataframes by setting 'key' as index

In [ ]:
df1.set_index('key').join(df2.set_index('key'))

      A    B
key
K0   A0   B0
K1   A1   B1
K2   A2   B2
K3   A3  NaN
K4   A4  NaN
K5   A5  NaN

#### Another option to join using the key columns is to use the on parameter. DataFrame.join always uses otherâ€™s index but we can use any column in df. This method preserves the original DataFrameâ€™s index in the result.

#### Join the dataframes on 'key' and set the 'key' as index only to df2

In [ ]:
df1.join(df2.set_index('key'), on='key')

  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K2  A2   B2
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN

- Using non-unique key values shows how they are matched.

In [ ]:
df3 = pd.DataFrame({'key': ['K0', 'K1', 'K1', 'K3', 'K0', 'K1'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
df3

  key   A
0  K0  A0
1  K1  A1
2  K1  A2
3  K3  A3
4  K0  A4
5  K1  A5

#### Join the dataframes df3 & df2 on 'key' and set the 'key' as index only to df2

In [ ]:
df3.join(df2.set_index('key'), on='key')

  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K1  A2   B1
3  K3  A3  NaN
4  K0  A4   B0
5  K1  A5   B1

### 6. Reshaping by pivoting DataFrame objects
<img src="https://pandas.pydata.org/docs/_images/reshaping_pivot.png" width=500px>

#### Create a dataframe as shown in the above image and then reshape it using pivot

In [ ]:
import pandas as pd
df = pd.DataFrame({ 'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']
                
})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [ ]:
df.shape

(6, 4)

In [ ]:
df_reshape = df.pivot(index = 'foo', columns = 'bar', values = 'baz')
df_reshape

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [ ]:
df_reshape.shape

(2, 3)

- One more example using pivoting

In [ ]:
import pandas._testing as tm
import numpy as np

In [ ]:
def unpivot(frame):
    N, K = frame.shape
    data = {
        "value": frame.to_numpy().ravel("F"),
        "variable": np.asarray(frame.columns).repeat(N),
        "date": np.tile(np.asarray(frame.index), K),
    }
    return pd.DataFrame(data, columns=["date", "variable", "value"])

In [ ]:
df = unpivot(tm.makeTimeDataFrame(3))
df

         date variable     value
0  2000-01-03        A -1.176840
1  2000-01-04        A  0.769123
2  2000-01-05        A -0.747608
3  2000-01-03        B  2.562683
4  2000-01-04        B  0.538884
5  2000-01-05        B -2.283462
6  2000-01-03        C  1.640854
7  2000-01-04        C -0.717483
8  2000-01-05        C -0.234238
9  2000-01-03        D -1.040035
10 2000-01-04        D  3.029135
11 2000-01-05        D -0.892383

In [ ]:
df.shape

(12, 3)

To select out everything for variable A we could do:

In [ ]:
filtered = df[df["variable"] == "A"]
filtered

        date variable     value
0 2000-01-03        A -1.176840
1 2000-01-04        A  0.769123
2 2000-01-05        A -0.747608

But suppose we wish to do time series operations with the variables. A better representation would be where the columns are the unique variables and an index of dates identifies individual observations. To reshape the data into this form, we use the DataFrame.pivot() method (also implemented as a top level function pivot()):

In [ ]:
pivoted = df.pivot(index="date", columns="variable", values="value")
pivoted

variable           A         B         C         D
date
2000-01-03 -1.176840  2.562683  1.640854 -1.040035
2000-01-04  0.769123  0.538884 -0.717483  3.029135
2000-01-05 -0.747608 -2.283462 -0.234238 -0.892383

In [ ]:
pivoted.shape

(3, 4)

##### we can clearly see the difference in shapes between df-> (12,3) and pivoted->(3,4)

If the values argument is omitted, and the input DataFrame has more than one column of values which are not used as column or index inputs to pivot(), then the resulting â€œpivotedâ€ DataFrame will have hierarchical columns whose topmost level indicates the respective value column:

In [ ]:
df["value2"] = df["value"] * 2
df

         date variable     value    value2
0  2000-01-03        A -1.176840 -2.353681
1  2000-01-04        A  0.769123  1.538245
2  2000-01-05        A -0.747608 -1.495217
3  2000-01-03        B  2.562683  5.125366
4  2000-01-04        B  0.538884  1.077768
5  2000-01-05        B -2.283462 -4.566923
6  2000-01-03        C  1.640854  3.281709
7  2000-01-04        C -0.717483 -1.434965
8  2000-01-05        C -0.234238 -0.468476
9  2000-01-03        D -1.040035 -2.080070
10 2000-01-04        D  3.029135  6.058269
11 2000-01-05        D -0.892383 -1.784767

In [ ]:
pivoted = df.pivot(index="date", columns="variable")
pivoted

               value                                  value2            \
variable           A         B         C         D         A         B
date
2000-01-03 -1.176840  2.562683  1.640854 -1.040035 -2.353681  5.125366
2000-01-04  0.769123  0.538884 -0.717483  3.029135  1.538245  1.077768
2000-01-05 -0.747608 -2.283462 -0.234238 -0.892383 -1.495217 -4.566923


variable           C         D
date
2000-01-03  3.281709 -2.080070
2000-01-04 -1.434965  6.058269
2000-01-05 -0.468476 -1.784767

In [ ]:
pivoted.shape

(3, 8)

You can then select subsets from the pivoted DataFrame:

In [ ]:
pivoted["value2"]

variable           A         B         C         D
date
2000-01-03 -2.353681  5.125366  3.281709 -2.080070
2000-01-04  1.538245  1.077768 -1.434965  6.058269
2000-01-05 -1.495217 -4.566923 -0.468476 -1.784767

### 7. Reshaping by Stacking and Unstacking
<img src="https://pandas.pydata.org/docs/_images/reshaping_stack.png" width=500px>
<img src="https://pandas.pydata.org/docs/_images/reshaping_unstack.png" width=500px>

#### Create a dataframe as shown in tha above image and then reshpae it using stacking and unstacking methods

In [ ]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz"],
            ["one", "two", "one", "two"],
        ]
    )
)

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

In [ ]:
df = pd.DataFrame({'A': [1,3,5,7],
                    'B': [2,4,6,8]},
                    index=index)
df

              A  B
first second
bar   one     1  2
      two     3  4
baz   one     5  6
      two     7  8

In [ ]:
stacked = df.stack()
stacked

first  second
bar    one     A    1
               B    2
       two     A    3
               B    4
baz    one     A    5
               B    6
       two     A    7
               B    8
dtype: int64

In [ ]:
stacked.unstack()

              A  B
first second
bar   one     1  2
      two     3  4
baz   one     5  6
      two     7  8

- One more example using stack and unstack

In [ ]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
df

                     A         B
first second
bar   one    -1.405012  0.714142
      two     0.932400 -0.277188
baz   one    -0.061721 -1.359831
      two    -0.287436  0.468479
foo   one    -0.777214 -2.038764
      two     0.699502 -2.198706
qux   one     0.740887 -0.193314
      two    -0.712798 -0.489767

In [ ]:
stacked = df.stack()
stacked

first  second
bar    one     A   -1.405012
               B    0.714142
       two     A    0.932400
               B   -0.277188
baz    one     A   -0.061721
               B   -1.359831
       two     A   -0.287436
               B    0.468479
foo    one     A   -0.777214
               B   -2.038764
       two     A    0.699502
               B   -2.198706
qux    one     A    0.740887
               B   -0.193314
       two     A   -0.712798
               B   -0.489767
dtype: float64

In [ ]:
stacked.unstack()

                     A         B
first second
bar   one    -1.405012  0.714142
      two     0.932400 -0.277188
baz   one    -0.061721 -1.359831
      two    -0.287436  0.468479
foo   one    -0.777214 -2.038764
      two     0.699502 -2.198706
qux   one     0.740887 -0.193314
      two    -0.712798 -0.489767

In [ ]:
print(stacked.unstack(0))
print('-'*100)
print(stacked.unstack('first'))

first          bar       baz       foo       qux
second
one    A -1.405012 -0.061721 -0.777214  0.740887
       B  0.714142 -1.359831 -2.038764 -0.193314
two    A  0.932400 -0.287436  0.699502 -0.712798
       B -0.277188  0.468479 -2.198706 -0.489767
----------------------------------------------------------------------------------------------------
first          bar       baz       foo       qux
second
one    A -1.405012 -0.061721 -0.777214  0.740887
       B  0.714142 -1.359831 -2.038764 -0.193314
two    A  0.932400 -0.287436  0.699502 -0.712798
       B -0.277188  0.468479 -2.198706 -0.489767

In [ ]:
print(stacked.unstack(1))
print('-'*100)
print(stacked.unstack('second'))

second        one       two
first
bar   A -1.405012  0.932400
      B  0.714142 -0.277188
baz   A -0.061721 -0.287436
      B -1.359831  0.468479
foo   A -0.777214  0.699502
      B -2.038764 -2.198706
qux   A  0.740887 -0.712798
      B -0.193314 -0.489767
----------------------------------------------------------------------------------------------------
second        one       two
first
bar   A -1.405012  0.932400
      B  0.714142 -0.277188
baz   A -0.061721 -0.287436
      B -1.359831  0.468479
foo   A -0.777214  0.699502
      B -2.038764 -2.198706
qux   A  0.740887 -0.712798
      B -0.193314 -0.489767

### 8. Reshaping by melt
<img src="https://pandas.pydata.org/docs/_images/reshaping_melt.png" width=500px>

#### Create a dataframe as shown in tha above image and then reshape it using melt command

In [ ]:
index = pd.MultiIndex.from_tuples([("person", "A"), ("person", "B")])

In [ ]:
df = pd.DataFrame(
    {
        "first": ["John", "Mary"],
        "last": ["Doe", "Bo"],
        "height": [5.5, 6.0],
        "weight": [130, 150],
    },
    index=index,
)
df

         first last  height  weight
person A  John  Doe     5.5     130
       B  Mary   Bo     6.0     150

In [ ]:
df.melt(id_vars=["first", "last"])

  first last variable  value
0  John  Doe   height    5.5
1  Mary   Bo   height    6.0
2  John  Doe   weight  130.0
3  Mary   Bo   weight  150.0

In [ ]:
df.melt(id_vars=["first", "last"], ignore_index=False)

         first last variable  value
person A  John  Doe   height    5.5
       B  Mary   Bo   height    6.0
       A  John  Doe   weight  130.0
       B  Mary   Bo   weight  150.0

### 9. Reshaping using wide_to_long
Another way to transform is to use the wide_to_long() panel data convenience function. It is less flexible than melt(), but more user-friendly.

In [ ]:
df = pd.DataFrame(
    {
        "A1970": {0: "a", 1: "b", 2: "c"},
        "A1980": {0: "d", 1: "e", 2: "f"},
        "B1970": {0: 2.5, 1: 1.2, 2: 0.7},
        "B1980": {0: 3.2, 1: 1.3, 2: 0.1},
        "X": dict(zip(range(3), np.random.randn(3))),
    }
)
df

  A1970 A1980  B1970  B1980         X
0     a     d    2.5    3.2 -0.935682
1     b     e    1.2    1.3  0.080313
2     c     f    0.7    0.1  2.319177

#### Reshape the above dataframe df using wide_to_long function

In [ ]:
df['id'] = df.index

In [ ]:
pd.wide_to_long(df, ["A", "B"], i="id", j="year")

                X  A    B
id year
0  1970 -0.935682  a  2.5
1  1970  0.080313  b  1.2
2  1970  2.319177  c  0.7
0  1980 -0.935682  d  3.2
1  1980  0.080313  e  1.3
2  1980  2.319177  f  0.1

---------
### Happy Learning :)
---------